docs/serving/prefill_campaign_2026-09-20/serving/graphs/sessions/throughput_SCRATCH_FULL_r2_a0/n512_c32/warmup.log
/usr/local/lib/python3.12/dist-packages/torch/cuda/__init__.py:65: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f0108dc7920>, trust_remote_code=False, seed=1002, num_prompts=64, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url=None, host='127.0.0.1', port=36293, endpoint='/v1/completions', header=None, max_concurrency=32, model='TinyLlama/TinyLlama-1.1B-Chat-v1.0', input_len=None, output_len=None, tokenizer='/root/.cache/huggingface/hub/models--TinyLlama--TinyLlama-1.1B-Chat-v1.0/snapshots/fe8a4ea1ffedaf415f4da2f062534de366a451e6', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/mnt/c/Users/PC/flashattn-cuda-main/docs/serving/prefill_campaign_2026-09-20/serving/graphs/sessions/throughput_SCRATCH_FULL_r2_a0/n512_c32', result_filename='warmup.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-5abd55b7-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 09-20 22:58:30 [datasets.py:700] Sampling input_len from [511, 511] and output_len from [128, 128]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 32
100%|██████████| 64/64 [00:04<00:00, 13.87it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     64        
Failed requests:                         0         
Maximum request concurrency:             32        
Benchmark duration (s):                  4.61      
Total input tokens:                      32704     
Total generated tokens:                  8192      
Request throughput (req/s):              13.87     
Output token throughput (tok/s):         1775.52   
Peak output token throughput (tok/s):    2556.00   
Peak concurrent requests:                64.00     
Total token throughput (tok/s):          8863.72   
---------------Time to First Token----------------
Mean TTFT (ms):                          558.76    
Median TTFT (ms):                        410.64    
P50 TTFT (ms):                           410.64    
P95 TTFT (ms):                           1163.70   
P99 TTFT (ms):                           1176.77   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          13.60     
Median TPOT (ms):                        13.97     
P50 TPOT (ms):                           13.97     
P95 TPOT (ms):                           15.55     
P99 TPOT (ms):                           16.14     
---------------Inter-token Latency----------------
Mean ITL (ms):                           13.60     
Median ITL (ms):                         10.46     
P50 ITL (ms):                            10.46     
P95 ITL (ms):                            11.77     
P99 ITL (ms):                            102.96    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          2285.36   
Median E2EL (ms):                        2259.23   
P50 E2EL (ms):                           2259.23   
P95 E2EL (ms):                           2952.04   
P99 E2EL (ms):                           2968.11   
==================================================